In [1]:
# Import pandas for DataFrame
import pandas as pd

In [2]:
# Identify files
schools_file = "Resources/schools_complete.csv"
students_file = "Resources/students_complete.csv"

In [3]:
# Load schools csv into a DataFrame
og_schools_df = pd.read_csv(schools_file, encoding="utf8")

og_schools_df.columns

Index(['School ID', 'school_name', 'type', 'size', 'budget'], dtype='object')

In [4]:
# Load students csv into a DataFrame
og_students_df = pd.read_csv(students_file, encoding="utf8")

og_students_df.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score'],
      dtype='object')

In [5]:
# Rename columns
renamed_schools_df = og_schools_df.rename(columns= {"school_name": "School Name",
                                                "type": "Type",
                                                "size": "Size",
                                                "budget": "Budget"})
renamed_schools_df.head()

   School ID            School Name      Type  Size   Budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [6]:
# Rename columns
renamed_students_df = og_students_df.rename(columns= {"student_name": "Student Name",
                                                  "gender": "Gender",
                                                  "grade": "Grade",
                                                  "school_name": "School Name",
                                                  "reading_score":"Reading Score",
                                                  "math_score": "Math Score"})
renamed_students_df.head()

,Student ID,Student Name,Gender,Grade,School Name,Reading Score,Math Score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [7]:
# District: TOTAL SCHOOLS
total_schools = renamed_schools_df["School ID"].count()

print(total_schools)

15

In [8]:
# District: TOTAL STUDENTS
total_students = renamed_students_df["Student ID"].count()

print(total_students)

39170

In [9]:
# District: TOTAL BUDGET
total_budget = renamed_schools_df["Budget"].sum()

print(total_budget)

24649428

In [73]:
# District: AVERAGE MATH SCORE
avg_math = round(renamed_students_df["Math Score"].mean(), 2)

print(avg_math)

78.99

In [74]:
# District: AVERAGE READING SCORE
avg_reading = round(renamed_students_df["Reading Score"].mean(), 2)

print(avg_reading)

81.88

In [75]:
# Find min and max of math scores
print(renamed_students_df["Math Score"].min())
print(renamed_students_df["Math Score"].max())

55
99

In [76]:
# Find min and max of reading scores
print(renamed_students_df["Reading Score"].min())
print(renamed_students_df["Reading Score"].max())

63
99

In [77]:
# District: PASSING MATH
# Passing Score: 70?
passed_math_df = renamed_students_df.loc[renamed_students_df["Math Score"] > 70, ["Student ID", "Student Name", "Gender", "Grade", 
                                                                "School Name", "Math Score", "Reading Score"]]
passed_math_df.head(2)

,Student ID,Student Name,Gender,Grade,School Name,Math Score,Reading Score
0,0,Paul Bradley,M,9th,Huang High School,79,66
4,4,Bonnie Ray,F,9th,Huang High School,84,97

In [78]:
# Number of Students: PASSED MATH
stu_passed_math = passed_math_df["Student ID"].count()

print(stu_passed_math)

28356

In [79]:
# District: PASSING READING
# Passing Score: 70?
passed_reading_df = renamed_students_df.loc[renamed_students_df["Reading Score"] > 70, ["Student ID", "Student Name", "Gender", "Grade", 
                                                               "School Name", "Reading Score", "Math Score"]]
passed_reading_df.head(2)

,Student ID,Student Name,Gender,Grade,School Name,Reading Score,Math Score
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60

In [80]:
# Number of Students: PASSED READING
stu_passed_reading = passed_reading_df["Student ID"].count()

print(stu_passed_reading)

32500

In [81]:
# District: OVERALL PASSING
# Passing Score: 70?
passed_both_df = passed_math_df.loc[passed_math_df["Reading Score"] > 70, ["Student ID", "Student Name", "Gender", "Grade", 
                                           "School Name", "Reading Score", "Math Score"]]
passed_both_df.head(2)

,Student ID,Student Name,Gender,Grade,School Name,Reading Score,Math Score
4,4,Bonnie Ray,F,9th,Huang High School,97,84
5,5,Bryan Miranda,M,9th,Huang High School,94,94

In [82]:
# Number of Students: PASSED BOTH
stu_passed_both = passed_both_df["Student ID"].count()

print(stu_passed_both)

23816

In [83]:
# District: % PASSING MATH
per_passing_math = round((stu_passed_math / total_students) * 100, 2)

print(per_passing_math)

72.39

In [84]:
# District: % PASSING READING
per_passing_reading = round((stu_passed_reading / total_students) * 100, 2)

print(per_passing_reading)

82.97

In [85]:
# District: % OVERALL PASSING
per_passing_both = round((stu_passed_both / total_students) * 100, 2)

print(per_passing_both)

60.8

In [86]:
# DISTRICT METRICS SUMMARY TABLE
district_metrics_df = pd.DataFrame({"Total Schools": [total_schools], 
                                    "Total Students": [total_students],
                                    "Total Budget": [total_budget], 
                                    "Average Math Score": [avg_math], 
                                    "Average Reading Score": [avg_reading],
                                    "% Passing Math": f"{per_passing_math}%", 
                                    "% Passing Reading": f"{per_passing_reading}%", 
                                    "% Passing Both": f"{per_passing_both}%"})

district_metrics_df.head()

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Passing Both
0,15,39170,24649428,78.99,81.88,72.39%,82.97%,60.8%

In [87]:
# All Students
all_grouped_metrics = renamed_students_df.groupby(["School Name"])

# all_grouped_metrics["Student ID"].count().head(15)

In [92]:
# Put student ID count into a DataFrame
student_ID_metrics_df = pd.DataFrame(all_grouped_metrics["Student ID"].count())
# Rename column
student_ID_metrics_df = student_ID_metrics_df.rename(columns={"Student ID": "Total Students"})
student_ID_metrics_df.head()

                      Total Students
School Name
Bailey High School              4976
Cabrera High School             1858
Figueroa High School            2949
Ford High School                2739
Griffin High School             1468

In [127]:
# Put average Scores into a DataFrame
scores_metrics_df = round(pd.DataFrame(all_grouped_metrics.mean()), 2)
# Remove student ID average
scores_metrics_df = scores_metrics_df[["Reading Score", "Math Score"]]
# Rename Columns
scores_metrics_df = scores_metrics_df.rename(columns={"Reading Score": "Average Reading Score",
                                             "Math Score": "Average Math Score"})
scores_metrics_df.head()

                      Average Reading Score  Average Math Score
School Name
Bailey High School                    81.03               77.05
Cabrera High School                   83.98               83.06
Figueroa High School                  81.16               76.71
Ford High School                      80.75               77.10
Griffin High School                   83.82               83.35

In [128]:
# Merge total students with average scores
grouped_metrics_df = pd.merge(student_ID_metrics_df, scores_metrics_df, on="School Name")
grouped_metrics_df.head()

,Total Students,Average Reading Score,Average Math Score
School Name,,,
Bailey High School,4976,81.03,77.05
Cabrera High School,1858,83.98,83.06
Figueroa High School,2949,81.16,76.71
Ford High School,2739,80.75,77.10
Griffin High School,1468,83.82,83.35

In [129]:
# Merge previous grouped metrics with school metrics
merged_df = pd.merge(grouped_metrics_df, renamed_schools_df, on="School Name")
# Rename columns
merged_df = merged_df.rename(columns={"Type": "School Type", "Budget": "Total School Budget"})  
# Reorder columns
merged_df = merged_df[["School Name", "School Type", "Total Students", "Total School Budget", 
                       "Average Math Score", "Average Reading Score"]]
# Create 'per student budget' column
merged_df["Per Student Budget"] = merged_df["Total School Budget"] / merged_df["Total Students"]

merged_df.head()

,School Name,School Type,Total Students,Total School Budget,Average Math Score,Average Reading Score,Per Student Budget
0,Bailey High School,District,4976,3124928,77.05,81.03,628.0
1,Cabrera High School,Charter,1858,1081356,83.06,83.98,582.0
2,Figueroa High School,District,2949,1884411,76.71,81.16,639.0
3,Ford High School,District,2739,1763916,77.10,80.75,644.0
4,Griffin High School,Charter,1468,917500,83.35,83.82,625.0

In [130]:
# Create a groupby for passing math, passing reading, and overall passing metrics
passed_math_groupby = passed_math_df.groupby(["School Name"])

passed_reading_groupby = passed_reading_df.groupby(["School Name"])

passed_both_groupby = passed_both_df.groupby(["School Name"])

In [131]:
# Put Passing Math metrics into a DataFrame
passed_math_metrics_df = pd.DataFrame(passed_math_groupby["Student ID"].count())
# Rename column
passed_math_metrics_df = passed_math_metrics_df.rename(columns={"Student ID": "Num Passing Math"})
#passed_math_metrics_df

# Put Passing Reading metrics into a DataFrame
passed_reading_metrics_df = pd.DataFrame(passed_reading_groupby["Student ID"].count())
# Rename column
passed_reading_metrics_df = passed_reading_metrics_df.rename(columns={"Student ID": "Num Passing Reading"})
#passed_reading_metrics_df


# Put Overall Passing metrics into a DataFrame
passed_both_metrics_df = pd.DataFrame(passed_both_groupby["Student ID"].count())
# Rename column
passed_both_metrics_df = passed_both_metrics_df.rename(columns={"Student ID": "Num Overall Passing"})
#passed_both_metrics_df

In [132]:
# Merge Passing number Metrics
passing_metrics_df = pd.merge(passed_math_metrics_df, passed_reading_metrics_df, on="School Name")
passing_metrics_df = pd.merge(passing_metrics_df, passed_both_metrics_df, on="School Name")

passing_metrics_df.head()

,Num Passing Math,Num Passing Reading,Num Overall Passing
School Name,,,
Bailey High School,3216,3946,2545
Cabrera High School,1664,1744,1561
Figueroa High School,1880,2313,1472
Ford High School,1801,2123,1405
Griffin High School,1317,1371,1228

In [133]:
# Merged passing number metrics with previous merged dataframe
school_merged_df = pd.merge(merged_df, passing_metrics_df, on="School Name")

# Calculate % passing
school_merged_df["% Passing Math"] = round((school_merged_df["Num Passing Math"] / school_merged_df["Total Students"])* 100, 2)
school_merged_df["% Passing Reading"] = round((school_merged_df["Num Passing Reading"] / school_merged_df["Total Students"]) * 100, 2)
school_merged_df["% Overall Passing"] = round((school_merged_df["Num Overall Passing"] / school_merged_df["Total Students"]) * 100, 2)

school_merged_df.head()

,School Name,School Type,Total Students,Total School Budget,Average Math Score,Average Reading Score,Per Student Budget,Num Passing Math,Num Passing Reading,Num Overall Passing,% Passing Math,% Passing Reading,% Overall Passing
0,Bailey High School,District,4976,3124928,77.05,81.03,628.0,3216,3946,2545,64.63,79.30,51.15
1,Cabrera High School,Charter,1858,1081356,83.06,83.98,582.0,1664,1744,1561,89.56,93.86,84.02
2,Figueroa High School,District,2949,1884411,76.71,81.16,639.0,1880,2313,1472,63.75,78.43,49.92
3,Ford High School,District,2739,1763916,77.10,80.75,644.0,1801,2123,1405,65.75,77.51,51.30
4,Griffin High School,Charter,1468,917500,83.35,83.82,625.0,1317,1371,1228,89.71,93.39,83.65

In [134]:
# SCHOOL SUMMARY METRICS
school_merged_df = school_merged_df[["School Name", "School Type", "Total Students", "Total School Budget", "Per Student Budget",
                                    "Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"]]

school_merged_df

,School Name,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,Bailey High School,District,4976,3124928,628.0,77.05,81.03,64.63,79.30,51.15
1,Cabrera High School,Charter,1858,1081356,582.0,83.06,83.98,89.56,93.86,84.02
2,Figueroa High School,District,2949,1884411,639.0,76.71,81.16,63.75,78.43,49.92
3,Ford High School,District,2739,1763916,644.0,77.10,80.75,65.75,77.51,51.30
4,Griffin High School,Charter,1468,917500,625.0,83.35,83.82,89.71,93.39,83.65
5,Hernandez High School,District,4635,3022020,652.0,77.29,80.93,64.75,78.19,50.16
6,Holden High School,Charter,427,248087,581.0,83.80,83.81,90.63,92.74,84.07
7,Huang High School,District,2917,1910635,655.0,76.63,81.18,63.32,78.81,49.91
8,Johnson High School,District,4761,3094650,650.0,77.07,80.97,63.85,78.28,49.80
9,Pena High School,Charter,962,585858,609.0,83.84,84.04,91.68,92.20,84.82
10,Rodriguez High School,District,3999,2547363,637.0,76.84,80.74,64.07,77.74,49.44
11,Shelton High School,Charter,1761,1056600,600.0,83.36,83.73,89.89,92.62,83.19
12,Thomas High School,Charter,1635,1043130,638.0,83.42,83.85,90.21,92.91,84.28
13,Wilson High School,Charter,2283,1319574,578.0,83.27,83.99,90.93,93.25,84.89
14,Wright High School,Charter,1800,1049400,583.0,83.68,83.96,90.28,93.44,84.44

In [163]:
# TOP 5 SCHOOLS
overall_highest_df = school_merged_df.sort_values("% Overall Passing", ascending=False)

# Reset indexes
overall_highest_df = overall_highest_df.reset_index(drop=True)

# Drop rows except for Top 5 
top_5_schools_df = overall_highest_df.iloc[0:5, :]
top_5_schools_df

,School Name,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,Wilson High School,Charter,2283,1319574,578.0,83.27,83.99,90.93,93.25,84.89
1,Pena High School,Charter,962,585858,609.0,83.84,84.04,91.68,92.20,84.82
2,Wright High School,Charter,1800,1049400,583.0,83.68,83.96,90.28,93.44,84.44
3,Thomas High School,Charter,1635,1043130,638.0,83.42,83.85,90.21,92.91,84.28
4,Holden High School,Charter,427,248087,581.0,83.80,83.81,90.63,92.74,84.07

In [165]:
# BOTTOM 5 SCHOOLS
overall_lowest_df = school_merged_df.sort_values("% Overall Passing", ascending=True)

# Reset indexes
overall_lowest_df = overall_lowest_df.reset_index(drop=True)

# Drop all rows except for Bottom 5
bottom_5_schools_df = overall_lowest_df.iloc[0:5, :]
bottom_5_schools_df

,School Name,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,Rodriguez High School,District,3999,2547363,637.0,76.84,80.74,64.07,77.74,49.44
1,Johnson High School,District,4761,3094650,650.0,77.07,80.97,63.85,78.28,49.80
2,Huang High School,District,2917,1910635,655.0,76.63,81.18,63.32,78.81,49.91
3,Figueroa High School,District,2949,1884411,639.0,76.71,81.16,63.75,78.43,49.92
4,Hernandez High School,District,4635,3022020,652.0,77.29,80.93,64.75,78.19,50.16

In [140]:
# Groupby school & grade
school_grade_grouped = renamed_students_df.groupby(["School Name", "Grade"])

# Convert math scores to DataFrame
school_grade_math_df = round(pd.DataFrame(school_grade_grouped["Math Score"].mean()), 2)
#school_grade_math_df

# Convert reading scores to DataFrame
school_grade_reading_df = round(pd.DataFrame(school_grade_grouped["Reading Score"].mean()), 2)
#school_grade_reading_df

In [141]:
# Rename Column: MATH SCORES BY GRADE
school_grade_math_df = school_grade_math_df.rename(columns={"Math Score": "Average Math Score"})
school_grade_math_df

                             Average Math Score
School Name           Grade
Bailey High School    10th                77.00
                      11th                77.52
                      12th                76.49
                      9th                 77.08
Cabrera High School   10th                83.15
                      11th                82.77
                      12th                83.28
                      9th                 83.09
Figueroa High School  10th                76.54
                      11th                76.88
                      12th                77.15
                      9th                 76.40
Ford High School      10th                77.67
                      11th                76.92
                      12th                76.18
                      9th                 77.36
Griffin High School   10th                84.23
                      11th                83.84
                      12th                83.36
                      9th                 82.04
Hernandez High School 10th                77.34
                      11th                77.14
                      12th                77.19
                      9th                 77.44
Holden High School    10th                83.43
                      11th                85.00
                      12th                82.86
                      9th                 83.79
Huang High School     10th                75.91
                      11th                76.45
                      12th                77.23
                      9th                 77.03
Johnson High School   10th                76.69
                      11th                77.49
                      12th                76.86
                      9th                 77.19
Pena High School      10th                83.37
                      11th                84.33
                      12th                84.12
                      9th                 83.63
Rodriguez High School 10th                76.61
                      11th                76.40
                      12th                77.69
                      9th                 76.86
Shelton High School   10th                82.92
                      11th                83.38
                      12th                83.78
                      9th                 83.42
Thomas High School    10th                83.09
                      11th                83.50
                      12th                83.50
                      9th                 83.59
Wilson High School    10th                83.72
                      11th                83.20
                      12th                83.04
                      9th                 83.09
Wright High School    10th                84.01
                      11th                83.84
                      12th                83.64
                      9th                 83.26

In [142]:
# Rename Column: READING SCORES BY GRADE
school_grade_reading_df = school_grade_reading_df.rename(columns={"Reading Score": "Average Reading Score"})
school_grade_reading_df

                             Average Reading Score
School Name           Grade
Bailey High School    10th                   80.91
                      11th                   80.95
                      12th                   80.91
                      9th                    81.30
Cabrera High School   10th                   84.25
                      11th                   83.79
                      12th                   84.29
                      9th                    83.68
Figueroa High School  10th                   81.41
                      11th                   80.64
                      12th                   81.38
                      9th                    81.20
Ford High School      10th                   81.26
                      11th                   80.40
                      12th                   80.66
                      9th                    80.63
Griffin High School   10th                   83.71
                      11th                   84.29
                      12th                   84.01
                      9th                    83.37
Hernandez High School 10th                   80.66
                      11th                   81.40
                      12th                   80.86
                      9th                    80.87
Holden High School    10th                   83.32
                      11th                   83.82
                      12th                   84.70
                      9th                    83.68
Huang High School     10th                   81.51
                      11th                   81.42
                      12th                   80.31
                      9th                    81.29
Johnson High School   10th                   80.77
                      11th                   80.62
                      12th                   81.23
                      9th                    81.26
Pena High School      10th                   83.61
                      11th                   84.34
                      12th                   84.59
                      9th                    83.81
Rodriguez High School 10th                   80.63
                      11th                   80.86
                      12th                   80.38
                      9th                    80.99
Shelton High School   10th                   83.44
                      11th                   84.37
                      12th                   82.78
                      9th                    84.12
Thomas High School    10th                   84.25
                      11th                   83.59
                      12th                   83.83
                      9th                    83.73
Wilson High School    10th                   84.02
                      11th                   83.76
                      12th                   84.32
                      9th                    83.94
Wright High School    10th                   83.81
                      11th                   84.16
                      12th                   84.07
                      9th                    83.83

In [143]:
# Minimum per student budget
print(school_merged_df["Per Student Budget"].min())

# Maxiumum per student budget
print(school_merged_df["Per Student Budget"].max())

578.0
655.0

In [144]:
# Minimum School Size
print(renamed_schools_df["Size"].min())

# Maximum School Size
print(renamed_schools_df["Size"].max())

427
4976

In [145]:
# Create spending DataFrame
spending_df = school_merged_df[["Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading",
                               "% Overall Passing", "Per Student Budget"]]

In [146]:
# Bins for school spending per student
spending_bins = [0, 600, 630, 645, 660]
spending_names = ["0-600", "601-630", "631-645", "646-660"]

In [147]:
# Create bins for spending
spending_df["Spending Range"] = pd.cut(spending_df["Per Student Budget"], spending_bins, labels=spending_names, include_lowest=True)
# Remove unneccessary columns
spending_range_df = spending_df[["Average Math Score", "Average Reading Score", "% Passing Math", 
                                 "% Passing Reading","% Overall Passing", "Spending Range"]]
spending_range_df

/Users/juliabrunett/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing,Spending Range
0,77.05,81.03,64.63,79.30,51.15,601-630
1,83.06,83.98,89.56,93.86,84.02,0-600
2,76.71,81.16,63.75,78.43,49.92,631-645
3,77.10,80.75,65.75,77.51,51.30,631-645
4,83.35,83.82,89.71,93.39,83.65,601-630
5,77.29,80.93,64.75,78.19,50.16,646-660
6,83.80,83.81,90.63,92.74,84.07,0-600
7,76.63,81.18,63.32,78.81,49.91,646-660
8,77.07,80.97,63.85,78.28,49.80,646-660
9,83.84,84.04,91.68,92.20,84.82,601-630
10,76.84,80.74,64.07,77.74,49.44,631-645
11,83.36,83.73,89.89,92.62,83.19,0-600
12,83.42,83.85,90.21,92.91,84.28,631-645
13,83.27,83.99,90.93,93.25,84.89,0-600
14,83.68,83.96,90.28,93.44,84.44,0-600

In [156]:
# OUTPUT: SCORES BY SCHOOL SPENDING (PER STUDENT)
spending_groupby = spending_range_df.groupby(["Spending Range"])
round(spending_groupby.mean().head(15),2)

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Spending Range,,,,,
0-600,83.43,83.89,90.26,93.18,84.12
601-630,81.41,82.96,82.01,88.30,73.21
631-645,78.52,81.62,70.94,81.65,58.74
646-660,77.00,81.03,63.97,78.43,49.96

In [149]:
# Count amount in Spending Range bins
spending_df["Spending Range"].value_counts()

0-600      5
631-645    4
646-660    3
601-630    3
Name: Spending Range, dtype: int64

In [150]:
# Create size DataFrame
size_df = pd.merge(school_merged_df, renamed_schools_df, on="School Name")
size_df = size_df[["School Name", "Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading",
                    "% Overall Passing", "Size"]]
#size_df

In [151]:
# Bins for school size
size_bins = [0, 2000, 3000, 5000]
size_names = ["Small", "Medium", "Large"]

In [152]:
# Create Bins for Size Range
size_df["Size Range"] = pd.cut(size_df["Size"], size_bins, labels=size_names, include_lowest=True)
# Remove unneccessary columns
size_range_df = size_df[["Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading",
                  "% Overall Passing", "Size Range"]]
size_range_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing,Size Range
0,77.05,81.03,64.63,79.30,51.15,Large
1,83.06,83.98,89.56,93.86,84.02,Small
2,76.71,81.16,63.75,78.43,49.92,Medium
3,77.10,80.75,65.75,77.51,51.30,Medium
4,83.35,83.82,89.71,93.39,83.65,Small
5,77.29,80.93,64.75,78.19,50.16,Large
6,83.80,83.81,90.63,92.74,84.07,Small
7,76.63,81.18,63.32,78.81,49.91,Medium
8,77.07,80.97,63.85,78.28,49.80,Large
9,83.84,84.04,91.68,92.20,84.82,Small
10,76.84,80.74,64.07,77.74,49.44,Large
11,83.36,83.73,89.89,92.62,83.19,Small
12,83.42,83.85,90.21,92.91,84.28,Small
13,83.27,83.99,90.93,93.25,84.89,Medium
14,83.68,83.96,90.28,93.44,84.44,Small

In [153]:
# Check amount in each bin
size_range_df["Size Range"].value_counts()

Small     7
Large     4
Medium    4
Name: Size Range, dtype: int64

In [155]:
# OUTPUT: SCORES BY SCHOOL SIZE
size_groupby = size_range_df.groupby(["Size Range"])
round(size_groupby.mean().head(15), 2)

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Size Range,,,,,
Small,83.50,83.88,90.28,93.02,84.07
Medium,78.43,81.77,70.94,82.00,59.00
Large,77.06,80.92,64.32,78.38,50.14

In [158]:
# Merge school tables for scores by school type
type_df = pd.merge(school_merged_df, renamed_schools_df, on="School Name")

school_type_df = type_df[["Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading",
                  "% Overall Passing", "Type"]]
school_type_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing,Type
0,77.05,81.03,64.63,79.30,51.15,District
1,83.06,83.98,89.56,93.86,84.02,Charter
2,76.71,81.16,63.75,78.43,49.92,District
3,77.10,80.75,65.75,77.51,51.30,District
4,83.35,83.82,89.71,93.39,83.65,Charter
5,77.29,80.93,64.75,78.19,50.16,District
6,83.80,83.81,90.63,92.74,84.07,Charter
7,76.63,81.18,63.32,78.81,49.91,District
8,77.07,80.97,63.85,78.28,49.80,District
9,83.84,84.04,91.68,92.20,84.82,Charter
10,76.84,80.74,64.07,77.74,49.44,District
11,83.36,83.73,89.89,92.62,83.19,Charter
12,83.42,83.85,90.21,92.91,84.28,Charter
13,83.27,83.99,90.93,93.25,84.89,Charter
14,83.68,83.96,90.28,93.44,84.44,Charter

In [160]:
# Find breakdown of school types
school_type_df["Type"].value_counts()

Charter     8
District    7
Name: Type, dtype: int64

In [159]:
# OUTPUT: SCORES BY SCHOOL TYPE
school_type_groupby = school_type_df.groupby(["Type"])
round(school_type_groupby.mean().head(15), 2)

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Type,,,,,
Charter,83.47,83.90,90.36,93.05,84.17
District,76.96,80.97,64.30,78.32,50.24